app/Controllers/HorasNegativasController.php

SELECT *
FROM `horas_negativas`
WHERE `fk_local` = '1'
AND `data` = '2004-01-01'
 LIMIT 1
UPDATE `horas_negativas` SET `fk_local` = '1', `diurno` = '10', `noturno` = '20', `data` = '2004-01-01'
WHERE `fk_local` = '1'
AND `data` = '2004-01-01'
---
    public function horasValidate()
    {
        $posto = $this->request->getPost('posto');
        $data = $this->request->getPost('data');
        $diurno = $this->request->getPost('diurno');
        $noturno = $this->request->getPost('noturno');

        $dataToInsertOrUpdate = [
            'fk_local' => $posto,
            'diurno' => $diurno,
            'noturno' => $noturno,
            'data' => $data
        ];

        // Verificar se já existe um registro com o mesmo fk_local e data
        $existingRecord = $this->horasNegativasModel
                            ->where('fk_local', $posto)
                            ->where('data', $data)
                            ->first();

        if ($existingRecord) {
            // Se existir, faça um update
            $updated = $this->horasNegativasModel
                            ->where('fk_local', $posto)
                            ->where('data', $data)
                            ->set($dataToInsertOrUpdate)
                            ->update();