app/Models/HorasNegativasModel.php

    public function getHorasNegativasByPostoData($posto, $data)
    {
        return $this->select('diurno, noturno')
                    ->where('fk_local', $posto)
                    ->where('data', $data)
                    ->first();
---
SELECT `diurno`, `noturno`
FROM `horas_negativas`
WHERE `fk_local` = '1'
AND `data` = '2026-03-25'
 LIMIT 1

    public function saveHoras($dados, $postoID)
    {
        foreach ($dados as $item) {
            $data_invisivel = $item['data_invisivel'];
            $diurno = $item['diurno'];
            $noturno = $item['noturno'];

            // Verificar se já existe um registro com a mesma data_invisivel e fk_local
            $existingRecord = $this->where('data', $data_invisivel)
                                   ->where('fk_local', $postoID)
                                   ->first();

            if ($existingRecord) {
                // Se existir, faz um UPDATE
                $this->update($existingRecord->id, [
                    'diurno' => $diurno == "" ? NULL : $diurno,
                    'noturno' => $noturno == "" ? NULL : $noturno,
                ]);
---
SELECT *
FROM `horas_negativas`
WHERE `data` = '2025-03-25'
AND `fk_local` = '1'
 LIMIT 1
UPDATE `horas_negativas` SET `diurno` = '1', `noturno` = NULL
WHERE `horas_negativas`.`id` IN ('275')