app/Models/PostosModel.php

    public function getAlldata()
    {
        return $this->findAll();
---
SELECT *
FROM `posto`

    public function getPosto($id)
	{
		return $this->find($id);
---
SELECT *
FROM `posto`
WHERE `posto`.`id` = '1'