app/Models/UsuarioModel.php

SELECT *
FROM `usuarios`
WHERE `login` = 'leandrocarlos'
 LIMIT 1
---
	public function getByUserName(string $usuario) : array {
		$rq = $this->where('login', $usuario)->first();

SELECT `usuarios`.`id` as `id_usuario`, `usuarios`.`nome`, `usuarios`.`sobrenome`, `usuarios`.`login`, `usuarios`.`senha`, `usuarios`.`nivel`, `usuarios`.`ativo`
FROM `usuarios`
WHERE `usuarios`.`id` IS NULL
---
	public function getUserData($userId) {
	    $query = $this->db->table($this->table)
	        ->select('usuarios.id as id_usuario, usuarios.nome, usuarios.sobrenome, usuarios.login, usuarios.senha, usuarios.nivel,
				usuarios.ativo')
	        ->where('usuarios.id', $userId)
	        ->get();